/**
 * 题目：棋子翻转
 * 题目描述：
 * 在4x4的棋盘上摆满了黑白棋子，黑白两色的位置和数目随机其中左上角坐标为(1,1),右下角坐标为(4,4),
 * 现在依次有一些翻转操作，要对一些给定支点坐标为中心的上下左右四个棋子的颜色进行翻转，请计算出翻转后的棋盘颜色。
 * 给定两个数组A和f,分别为初始棋盘和翻转位置。其中翻转位置共有3个。请返回翻转后的棋盘。
 * 测试样例：
 * [[0,0,1,1],[1,0,1,0],[0,1,1,0],[0,0,1,0]],[[2,2],[3,3],[4,4]]
 * 返回：[[0,1,1,1],[0,0,1,0],[0,1,1,0],[0,0,1,0]]
 * 
 * 分析：所谓翻转，就是(2,2),(3,3),(4,4)的上下左右数字取反
 * @author geyan
 *
 */
public class Flip {

	public int[][] flipChess(int[][] A, int[][] f) {
		for (int i = 0; i < f.length; i++) {
			// 因为坐标是从(1,1)开始的，减1之后，就是从(0,0)开始。第一行的值(row,col)
			int row = f[i][0] - 1;
			int col = f[i][1] - 1;
			// 上
			if (row - 1 >= 0) {
				A[row - 1][col] = A[row - 1][col] == 0 ? 1 : 0;
			}
			// 下
			if (row + 1 <= 3) {
				A[row + 1][col] = A[row + 1][col] == 0 ? 1 : 0;
			}
			// 左
			if (col - 1 >= 0) {
				A[row][col - 1] = A[row][col - 1] == 0 ? 1 : 0;
			}
			// 右
			if (col + 1 <= 3) {
				A[row][col + 1] = A[row][col + 1] == 0 ? 1 : 0;
			}
		}
		return A;
	}
}
