/**
 * ÁÚ½Ó¾ØÕó±íÊ¾ÏÂµÄÍ¼µÄprimËã·¨ Prim:Çó×îÐ¡Éú³ÉÊ÷£¬n¸ö¶¥µã,n-1Ìõ±ß£¬ÇÒÈ¨ÖµÖ®ºÍ×îÐ¡
 * ¿ªÊ¼Ñ¡ÔñÈÎÒâ¶¥µãV0£¬´ÓÊ£Óà¶¥µãÖÐÑ¡ÔñÓëVOÏàÁ¬µÄ(¼´Î´¼ÓÈëµ½×îÐ¡Éú³ÉÊ÷µÄV0µÄÁÚ¾Ó½Úµã)£¬ÇÒÈ¨Öµ×îÐ¡µÄ(¼ÙÉèÑ¡ÔñµÄÊÇV3)£¬ÄÇÃ´½«V0,
 * V3¼°ÆäÁ¬±ß¼ÓÈëµ½×îÐ¡Éú³ÉÊ÷ÖÐ È»ºó´ÓÓëV0,V3µÄÁÚ¾Ó½ÚµãÖÐÑ¡ÔñÈ¨Öµ×îÐ¡µÄ(±ÈÈçV4)£¬ÔÙ´ÓV0,V3,V4µÄÁÚ¾Ó½ÚµãÖÐÑ¡ÔñÈ¨Öµ×îÐ¡µÄ...
 * 
 * @author geyan
 *
 */
public class PrimByMatrix {

	// Í¼µÄ¶¥µã¼¯ºÏ
	private char[] mVexs;

	// ÁÚ½Ó¾ØÕó
	private int[][] mMatrix;

	/**
	 * ¹Ø¼üµã¾ÍÔÚÓÚ¶ÔweightsÊý×éµÄ²Ù×÷ 
	 * 1.weightsÊý×é¸³Öµ 
	 * 2.ÕÒ³öweightsÊý×éÖÐ×îÐ¡Öµ 
	 * 3.¸üÐÂweightsÊý×é
	 * 
	 * @param start
	 *            ´ÓÍ¼ÖÐµÚstart½Úµã¿ªÊ¼Éú³É×îÐ¡Ê÷
	 */
	public void prim(int start) {
		int num = mVexs.length;

		// primµÄ½á¹ûÊý×é
		char[] prim = new char[num];
		int index = 0;
		// Ê×ÏÈ½«start¶¥µã¼ÓÈëµ½×îÐ¡Éú³ÉÊ÷ÖÐ
		prim[index++] = mVexs[start];

		// ²»ÊÇ¸÷¸ö¶¥µã¼äµÄÈ¨Öµ£¬weights[i]±íÊ¾ÒÑ¼ÓÈëµ½×îÐ¡Éú³ÉÊ÷ÖÐµÄ¶¥µãµ½Î´¼ÓÈëµ½×îÐ¡Éú³ÉÊ÷ÖÐµÄ¶¥µãiµÄÈ¨Öµ
		// ÕâÑùºÍÍ¼µÄ±éÀúÊÇÀàËÆµÄ£¬¶¼ÊÇÐèÒª½«¶¥µã·ÖÎªÁ½¸ö²¿·Ö£¬²»Í¬µÄÊÇÍ¼µÄ±éÀú£¬¿ÉÒÔ¶¨ÒåboolÊý×éÀ´±íÊ¾ÊÇ·ñÒÑ¾­±»·ÃÎÊ
		// ÕâÀïÉæ¼°µ½È¨Öµ£¬Ã»ÓÐ±ØÒªÔÙÈ¥¶¨ÒåboolÊý×é£¬¿ÉÒÔÉèÖÃÁîweights[i]=0,±íÊ¾½ÚµãiÒÑ¾­¼ÓÈëµ½×îÐ¡Éú³ÉÊ÷ÖÐ
		int[] weights = new int[num];

		for (int i = 0; i < num; i++) {
			// ÒÔstartÎªÆðµã£¬½«startµ½¸÷¸ö¶¥µãµÄÈ¨ÖµÒÀ´Î¸³Öµ¸øweightsÊý×é
			weights[i] = mMatrix[start][i];
		}

		// ÈôstartÒÑ¾­¼ÓÈëµ½×îÐ¡Éú³ÉÊ÷ÖÐ
		weights[start] = 0;

		// Ã¿Ò»´ÎµÄÑ­»·ÐèÒªÕÒ³öweightsÊý×éÖÐµÄ×îÐ¡Öµ£¬È»ºó¸üÐÂweights
		for (int i = 0; i < num; i++) {
			if (i == start)
				continue;
			int j = 0;
			int k = 0;
			int min = Integer.MAX_VALUE;
			// ÔÚÎ´±»¼ÓÈëµ½×îÐ¡Éú³ÉÊ÷µÄ¶¥µãÖÐ£¬ÕÒ³öÈ¨Öµ×îÐ¡µÄ¶¥µã
			while (j < num) {
				// weights[j]!=0±íÊ¾mVexs[j]½Úµã²¢Ã»ÓÐ¼ÓÈëµ½×îÐ¡Éú³ÉÊ÷ÖÐ£¬ÀàËÆÓëÍ¼µÄ±éÀúÖÐµÄvisited[j]
				if (weights[j] != 0 && weights[j] < min) {
					min = weights[j];
					k = j;
				}
				j++;
			}

			// ´ËÊ±£¬È¨Öµ×îÐ¡µÄ¶¥µã¾ÍÊÇmVexs[k]£¬½«¸Ã¶¥µã¼ÓÈëµ½×îÐ¡Éú³ÉÊ÷ÖÐ
			prim[index++] = mVexs[k];
			weights[k] = 0;
			// ÒòÎªmVexs[k]¶¥µãÒÑ¾­¼ÓÈëµ½×îÐ¡Éú³ÉÊ÷ÖÐ£¬ËùÒÔweights[k]=0
			// ¸üÐÂweightsÊý×é£¬ÆäÊµ¾ÍÊÇÕÒ³ökÓëÆäËû¶¥µãµÄµÄÈ¨ÖµºÍstartÓëÆäËû¶¥µãµÄÈ¨Öµ£¬Èç¹ûÇ°ÕßÐ¡£¬Ôò¸üÐÂ¶ÔÓ¦weightsÊý×éÔªËØ
			for (j = 0; j < num; j++) {
				if (weights[j] != 0 && mMatrix[k][j] < weights[j]) {
					weights[j] = mMatrix[k][j];
				}
			}
		}
		// ----------------------------------------------------------------

		/**
		 * primÊý×éÖÐÔªËØ¾ÍÊÇÒÀ´Î¼ÓÈëµ½×îÐ¡Éú³ÉÊ÷µÄ¶¥µã
		 */
	}
}
